"""
Напишите программу, которая по данному числу n от 1 до 9 выводит на экран n флагов. Изображение одного флага имеет
размер 4×4 символов, между двумя соседними флагами также имеется пустой (из пробелов) столбец. Разрешается вывести
пустой столбец после последнего флага. Внутри каждого флага должен быть записан его номер — число от 1 до n.

Формат ввода
Вводится натуральное число.

Формат вывода
Выведите ответ на задачу.
"""

n = int(input())
for i in range(n):
    print('+___', end=' ')
print()
for i in range(n):
    print(f'|{i + 1} /', end=' ')
print()
for i in range(n):
    print('|__', "\\", sep='', end=' ')
print()
for i in range(n):
    print('|   ', end=' ')
print()
