"""На склад, который имеет форму прямоугольного параллелепипеда, привезли ноутбуки, упакованные в коробки. Каждая
коробка также имеет форму прямоугольного параллелепипеда. По правилам хранения коробки с ноутбуками должны быть
размещены на складе с выполнением следующих двух условий:

Стороны коробок должны быть параллельны сторонам склада. Коробку при помещении на склад разрешается расположить где
угодно (с выполнением предыдущего условия), в том числе на другой коробке, но все коробки должны быть ориентированы
одинаково (т.е. нельзя одну коробку расположить “стоя”, а другую —“лежа”) Напишите программу, которая по размерам
склада и размерам коробки с ноутбуком определит максимальное количество ноутбуков, которое может быть размещено на
складе.

Формат ввода
Программа получает на вход шесть натуральных чисел. Первые три задают длину, высоту и ширину склада. Следующие три
задают соответственно длину, высоту и ширину коробки с ноутбуком.

Формат вывода
Программа должна вывести одно число — максимальное количество ноутбуков, которое может быть размещено на складе.
"""
a1 = int(input())
b1 = int(input())
c1 = int(input())
x = int(input())
y = int(input())
z = int(input())

d1 = (a1 // x) * (b1 // y) * (c1 // z)
d2 = (a1 // x) * (c1 // y) * (b1 // z)
d3 = (b1 // x) * (c1 // y) * (a1 // z)
d4 = (b1 // x) * (a1 // y) * (c1 // z)
d5 = (c1 // x) * (a1 // y) * (b1 // z)
d6 = (c1 // x) * (b1 // y) * (a1 // z)

if d1 >= d2:
    d2 = d1
if d3 >= d4:
    d4 = d2
if d5 >= d6:
    d6 = d5

if d2 >= d4 and d2 >= d6:
    print(d2)
elif d4 >= d6:
    print(d4)
else:
    print(d6)
